window.onload = function(){
	function f(){
        console.log('从前有座山，山里有座庙，庙里有个老和尚在给小和尚讲故事；');
        f();
    };
    f();

    //必须要有结束条件
    var i = 0;
    function f(){
        i++;
        console.log('从前有座山，山里有座庙，庙里有个老和尚在给小和尚讲故事；');
        if(i<10){
            f();
        };
    };
    f();

    //计算1-5递归相加 1+2+3+4+5
    function f(n){
        if(n==1){
            return 1;
        };
        return n + f(n-1);
    };
    f(5);
    //执行步骤：
    //1、传入5----if不成立------5+----f(5-1)自调
    //2、传入4----if不成立------4+----f(4-1)自调
    //3、传入3----if不成立------3+----f(3-1)自调
    //4、传入2----if不成立------2+----f(2-1)自调
    //5、传入1----if成立------返回1-----return 1终止   结束，不会再去执行 return n + f(n-1);

    //另一种方式
    function f(n){
        if(n>=1){
            return n + f(n-1);
        };
        return 0;
    };
    f(5);
    //执行步骤：
     //1、传入5----if成立------5+----f(5-1)自调
     //2、传入4----if成立------4+----f(4-1)自调
     //3、传入3----if成立------3+----f(3-1)自调
     //4、传入2----if成立------2+----f(2-1)自调
     //5、传入1----if成立------1+----f(1-1)自调
     //6、传入0----if不成立------0   结束，不会再去执行
}